sharad-patil24/connectedhomeip/examples/thermostat/efr32/include/AppTask.h
/*
 *
 *    Copyright (c) 2020 Project CHIP Authors
 *    Copyright (c) 2019 Google LLC.
 *    All rights reserved.
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

#pragma once

/**********************************************************
 * Includes
 *********************************************************/

#include <stdbool.h>
#include <stdint.h>

#include "AppEvent.h"
#include "BaseApplication.h"
#include "FreeRTOS.h"
#include "sl_simple_button_instances.h"
#include "timers.h" // provides FreeRTOS timer support
#include <app/clusters/identify-server/identify-server.h>
#include <ble/BLEEndPoint.h>
#include <lib/core/CHIPError.h>
#include <platform/CHIPDeviceLayer.h>

/**********************************************************
 * Defines
 *********************************************************/

// Application-defined error codes in the CHIP_ERROR space.
#define APP_ERROR_EVENT_QUEUE_FAILED CHIP_APPLICATION_ERROR(0x01)
#define APP_ERROR_CREATE_TASK_FAILED CHIP_APPLICATION_ERROR(0x02)
#define APP_ERROR_UNHANDLED_EVENT CHIP_APPLICATION_ERROR(0x03)
#define APP_ERROR_CREATE_TIMER_FAILED CHIP_APPLICATION_ERROR(0x04)
#define APP_ERROR_START_TIMER_FAILED CHIP_APPLICATION_ERROR(0x05)
#define APP_ERROR_STOP_TIMER_FAILED CHIP_APPLICATION_ERROR(0x06)

/**********************************************************
 * AppTask Declaration
 *********************************************************/

class AppTask : public BaseApplication
{

public:
    AppTask() = default;

    static AppTask & GetAppTask() { return sAppTask; }

    /**
     * @brief AppTask task main loop function
     *
     * @param pvParameter FreeRTOS task parameter
     */
    static void AppTaskMain(void * pvParameter);

    CHIP_ERROR StartAppTask();

    /**
     * @brief Event handler when a button is pressed
     * Function posts an event for button processing
     *
     * @param buttonHandle APP_LIGHT_SWITCH or APP_FUNCTION_BUTTON
     * @param btnAction button action - SL_SIMPLE_BUTTON_PRESSED,
     *                  SL_SIMPLE_BUTTON_RELEASED or SL_SIMPLE_BUTTON_DISABLED
     */
    void ButtonEventHandler(const sl_button_t * buttonHandle, uint8_t btnAction) override;

    /**
     * @brief Callback called by the identify-server when an identify command is received
     *
     * @param identify identify structure the command applies on
     */
    static void OnIdentifyStart(Identify * identify);

    /**
     * @brief Callback called by the identify-server when an identify command is stopped or finished
     *
     * @param identify identify structure the command applies on
     */
    static void OnIdentifyStop(Identify * identify);

    enum ThermoFunction_t
    {
        kFunction_Nothing   = 0,
        kFunction_AppFn     = 1,
        kFunction_Temp      = 2,

        kFunction_Invalid
    } ThermoFunction;

private:
    static AppTask sAppTask;

    /**
     * @brief AppTask initialisation function
     *
     * @return CHIP_ERROR
     */
    CHIP_ERROR Init();

    /**
     * @brief PB0 Button event processing function
     *        Press and hold will trigger a factory reset timer start
     *        Press and release will restart BLEAdvertising if not commisionned
     *
     * @param aEvent button event being processed
     */
    static void ButtonHandler(AppEvent * aEvent);

    /**
     * @brief Function called to start the mode timer
     *
     * @param aTimeoutMs timer duration in ms
     */
    static void StartModeTimer(uint32_t aTimeoutInMs);

    /**
     * @brief Function to stop the mode timer
     */
    static void CancelModeTimer();

    /**
     * @brief Function called to start the app function timer
     *
     * @param aTimeoutMs timer duration in ms
     */
    static void StartAppFnTimer(uint32_t aTimeoutInMs);

    /**
     * @brief Function to stop app function timer
     */
    static void CancelAppFnTimer();

    /**
     * @brief Mode Timer finished callback function
     *        Post an ModeHandler event
     *
     * @param xTimer timer that finished
     */
    static void ModeTimerEventHandler(TimerHandle_t xTimer);
    
    /**
     * @brief App Function Timer finished callback function
     *        Post an AppFnHandler event
     *
     * @param xTimer timer that finished
     */
    static void AppFnTimerEventHandler(TimerHandle_t xTimer);

    /**
     * @brief Mode Timer Event processing function
     *        Handles toggling the mode
     *
     * @param aEvent post event being processed
     */
    static void ModeHandler(AppEvent * aEvent);
    
    /**
     * @brief App Function Timer Event processing function
     *        Calls factory reset handler from BaseApplication.cpp
     *
     * @param aEvent post event being processed
     */
    static void AppFnHandler(AppEvent * aEvent);

    /**
     * @brief Handles temperature changes depending on timer status
     *
     * @param aEvent post event being processed
     */
    static void TemperatureHandler(AppEvent * aEvent);
};
